/*------------------------------------------------------------------*/
/* --- 51 car by zhangyuhude@163.com -------------------------------*/
/*------------------------------------------------------------------*/

#include "reg52.h"
#include <intrins.h>
#include "moto.h"
#include "is_compatible.h"
#include "delay.h"
#include "buzz.h"
#include "serial.h"
#include <NRF24L01.h>
#include "control.h"

//add this sentence in order to test git 2

#if (USE_NRF24L01 == 1)
//**********************************按键IO端口定义*********************************************

sbit    KEY1=P2^6;
sbit    KEY2=P3^7;

//**********************************LED指示灯**************************************************

sbit    LED1=P0^3;                  //指示灯
sbit    LED2=P0^4;                  //指示灯

//**********************************串口通信相关变量*******************************************

uchar   flag1,flag2;
//**********************************子函数申明*********************************************
// 函数名称： com_interrup()串口接收中断处理函数
// 函数功能： 接收包括起始位'S'在内的十位数据到数据缓冲区
//**********************************子函数申明*********************************************

com_interrupt(void) interrupt 4 using 3
{
    if(RI)                                //处理接收中断
    {
        TxBuf[flag1]=SBUF;
        RI=0;                                //清除中断标志位
        flag1++;
        if(flag1==32)
        {
            flag1=0;
            flag2=1;
        }
    }
}

//**********************************子函数申明*********************************************
//函 数:   R_S_Byte(uchar R_Byte)
//功 能:   数据发送
//**********************************子函数申明*********************************************

void R_S_Byte(uchar R_Byte)
{
     SBUF = R_Byte;
     while( TI == 0 );              //查询法
     TI = 0;
}
#endif


void main(void)
{
#if (USE_BLUETOOTH_SERIAL_MODULE == 1)
 serial_init();
while(1)
{
    serial_control_car();
    buzz_count_di(get_serial_number());
}
#endif

#if (USE_NRF24L01 == 1)
    uchar i =0,tf=0;

    init_NRF24L01() ;               //初始化 NRF24L01/NRF24L01+

    Delay(600);
    serial_init();                    //初始化 UART

//*************************************************************************************************
    while(1)
    { 
#if (NRF_USED_RECEIVE == 0)
        receive_nrf_data();
        car_control(get_car_station_current());
#endif
#if (NRF_USED_SEND == 1)
//***********************检测串口数据，当串口有数据时发送******************************************
        if(flag2==1)                                      //当收到串口数据后发送
        {
            nRF24L01_TxPacket(TxBuf);                // 发送数据
            flag2=0;
            LED1=0;       LED2=0;                  //LED闪烁，表示发送进行中
            inerDelay_us(1000);
        }
//***********************检测串口数据，当串口有数据时发送********************************************
        if(KEY1 ==0 )                //当KEY1（P2.0)和地短接时
        {
            LED1=0; 
            LED2=1;             
            TxBuf[0] = 0x20 ;
            tf = 1 ;
        }
//*************************************************************************************************
        if(KEY2 ==0)                //当KEY2(P3.7)和地短接时
        {
            LED1=1; LED2=0; TxBuf[0] = 0x37 ;tf = 1 ;
        }
//*************************************************************************************************
        if (tf==1)
        {
            nRF24L01_TxPacket(TxBuf);               //发送数据
            tf=0;
            inerDelay_us(1000);
        }
        LED1=1; LED2=1;
    }
#endif

#endif
}

